In [43]:
from pydataset import data
import pandas as pd
import numpy as np
import matplotlib as plt
import env
from env import host, user, password

In [44]:
# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

In [45]:
# cd into your exercises folder for this module and run echo env.py >> .gitignore
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [46]:
# Create a function named get_db_url. It should accept a username, hostname, password, and 
# database name and return a url connection string formatted like in the example at the start of this lesson.

def get_db_url(username, hostname, password, database):
    url = f'mysql+pymysql://{username}:{password}@{hostname}/{database}'
    return url

In [48]:
# Use your function to obtain a connection to the employees database.
url = get_db_url(user, host, password, 'employees')

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [6]:
# Once you have successfully run a query:
# a. Intentionally make a typo in the database url. What kind of error message do you see?

# connection error

In [7]:
# b. Intentionally make an error in your SQL query. What does the error message look like?

# query error

In [49]:
# Read the employees and titles tables into two separate DataFrames.

employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

In [50]:
#How many rows and columns do you have in each DataFrame? Is that what you expected?

employees_df.shape
#titles_df.shape

(300024, 6)

In [10]:
# Display the summary statistics for each DataFrame.

employees_df.describe()
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [11]:
# How many unique titles are in the titles DataFrame?

len(pd.read_sql('SELECT DISTINCT title FROM titles', url))

7

In [12]:
# What is the oldest date in the to_date column?

oldest_to_date = (pd.read_sql('SELECT min(to_date) FROM titles', url))
oldest_to_date

  min(to_date)
0   1985-03-01

In [13]:
# What is the most recent date in the to_date column?

most_recent_to_date = (pd.read_sql('SELECT max(to_date) FROM titles WHERE to_date < NOW()', url))
most_recent_to_date

  max(to_date)
0   2002-08-01

In [14]:
# Exercises II
# Copy the users and roles DataFrames from the examples above.

# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [15]:
# What is the result of using a right join on the DataFrames?

users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [16]:
# What is the result of using an outer join on the DataFrames?

users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [17]:
# What happens if you drop the foreign keys from the DataFrames and try to merge them?

users.drop(columns='role_id', inplace=True)
roles.drop(columns='id',inplace=True)

#users.merge(roles, left_on='role_id', right_on='id', how='inner', indicator=True)

# key error is received

In [18]:
# Load the mpg dataset from PyDataset.

mpg = data('mpg')

In [19]:
# Output and read the documentation for the mpg dataset.

data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [20]:
#How many rows and columns are in the dataset?

mpg.shape

(234, 11)

In [21]:
# Check out your column names and perform any cleanup you may want on them.

mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [22]:
# Display the summary statistics for the dataset.

mpg.describe().T

       count         mean       std     min     25%     50%     75%     max
displ  234.0     3.471795  1.291959     1.6     2.4     3.3     4.6     7.0
year   234.0  2003.500000  4.509646  1999.0  1999.0  2003.5  2008.0  2008.0
cyl    234.0     5.888889  1.611534     4.0     4.0     6.0     8.0     8.0
cty    234.0    16.858974  4.255946     9.0    14.0    17.0    19.0    35.0
hwy    234.0    23.440171  5.954643    12.0    18.0    24.0    27.0    44.0

In [23]:
# How many different manufacturers are there?

len(mpg.groupby('manufacturer'))

15

In [24]:
# How many different models are there?

len(mpg.groupby('model'))

38

In [25]:
# Create a column named mileage_difference like you did in the DataFrames exercises; 
# this column should contain the difference between highway and city mileage for each car.

mpg['mileage_difference'] = mpg.hwy - mpg.cty

In [26]:
# Create a column named average_mileage like you did in the DataFrames exercises; 
# this is the mean of the city and highway mileage.

mpg['average_mileage'] = (mpg.hwy + mpg.cty) / 2

In [27]:
# Create a new column on the mpg dataset named is_automatic that holds boolean values 
# denoting whether the car has an automatic transmission.

mpg['is_automatic'] = np.where(mpg.trans.str.contains('auto'), True, False)

In [51]:
# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values(ascending=False)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
toyota        21.720588
pontiac       21.700000
nissan        21.346154
chevrolet     18.447368
ford          16.680000
mercury       15.625000
jeep          15.562500
dodge         15.540541
lincoln       14.166667
land rover    14.000000
Name: average_mileage, dtype: float64

In [29]:
# Do automatic or manual cars have better miles per gallon?

mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

In [30]:
# Exercises III
# Use your get_db_url function to help you explore the data from the chipotle database.

url2 = get_db_url(user, host, password, 'chipotle')

chipotle = pd.read_sql('SELECT * FROM orders', url2)
chipotle

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [31]:
#What is the total price for each order?

chipotle['item_price'] = chipotle['item_price'].str.strip('$')
chipotle['item_price'] = chipotle['item_price'].str.strip().astype('float')

In [32]:
chipotle.groupby('order_id').item_price.agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [33]:
# What are the most popular 3 items?

chipotle.groupby('item_name').quantity.agg('sum').nlargest(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [34]:
# Which item has produced the most revenue?

# add a column for total
chipotle['total'] = chipotle.quantity * chipotle.item_price

In [35]:
# group by total and return item with highest sum of totals
chipotle.groupby('item_name').total.agg('sum').nlargest(1)

item_name
Chicken Bowl    8044.63
Name: total, dtype: float64

In [36]:
# Join the employees and titles DataFrames together.
    # need to use emp_no
merged_employee_title = employees_df.merge(titles_df, how='inner', left_on='emp_no', right_on='emp_no')

In [37]:
#For each title, find the hire date of the employee that was hired most recently with that title.

merged_employee_title.groupby('title').hire_date.agg('max')

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [38]:
# Write the code necessary to create a cross tabulation of the number of titles by department. 
# (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas 
# code to perform the manipulations.)

# create URL to get data
employees2_url = get_db_url(user, host, password, 'employees')

# SQL to get all necessary data
sql = '''
SELECT emp_no, dept_name, title 
FROM dept_emp
JOIN departments
USING(dept_no)
JOIN titles
USING(emp_no);
'''

# Bring in data as dataframe
employees2 = pd.read_sql(sql,employees2_url)

In [39]:
# crosstab to get appropriate output

In [40]:
pd.crosstab(employees2.dept_name, employees2.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0